In [3]:
from pathlib import Path
Path("Resources/titanic_data.sqlite").touch()

In [4]:
#!/usr/bin/python

import sqlite3

conn = sqlite3.connect('Resources/titanic_data.sqlite')

print("Opened database successfully")

c = conn.cursor()

Opened database successfully

In [6]:
c.execute( '''CREATE TABLE titanic_data 
              (pclass int, 
               survived int, 
               name text, 
               sex text, 
               age double, 
               sibsp int, 
               parch int, 
               ticket int,
               fare double,
               cabin text,
               embarked text,
               boat int,
               body double,
               PRIMARY KEY (Name, ticket)) ''' )

In [7]:
import pandas as pd

table1 = pd.read_csv("Resources/raw_dataset.csv")

table1.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body'],
      dtype='object')

In [8]:
table1.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body
0,1,1,Allen. Miss. Elisabeth Walton,female,29.0000,0,0,24160,211.3375,B5,S,2,NaN
1,1,1,Allison. Master. Hudson Trevor,male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN
2,1,0,Allison. Miss. Helen Loraine,female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN
3,1,0,Allison. Mr. Hudson Joshua Creighton,male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0
4,1,0,Allison. Mrs. Hudson J C (Bessie Waldo Daniels),female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN

In [9]:
table1.to_sql('titanic_data', conn, if_exists='append', index=False)

1309

In [10]:
c.execute('''SELECT * FROM titanic_data LIMIT 10''').fetchall()

[(1,
  1,
  'Allen. Miss. Elisabeth Walton',
  'female',
  29.0,
  0,
  0,
  24160,
  211.3375,
  'B5',
  'S',
  2,
  None),
 (1,
  1,
  'Allison. Master. Hudson Trevor',
  'male',
  0.9167,
  1,
  2,
  113781,
  151.55,
  'C22 C26',
  'S',
  11,
  None),
 (1,
  0,
  'Allison. Miss. Helen Loraine',
  'female',
  2.0,
  1,
  2,
  113781,
  151.55,
  'C22 C26',
  'S',
  None,
  None),
 (1,
  0,
  'Allison. Mr. Hudson Joshua Creighton',
  'male',
  30.0,
  1,
  2,
  113781,
  151.55,
  'C22 C26',
  'S',
  None,
  135.0),
 (1,
  0,
  'Allison. Mrs. Hudson J C (Bessie Waldo Daniels)',
  'female',
  25.0,
  1,
  2,
  113781,
  151.55,
  'C22 C26',
  'S',
  None,
  None),
 (1,
  1,
  'Anderson. Mr. Harry',
  'male',
  48.0,
  0,
  0,
  19952,
  26.55,
  'E12',
  'S',
  3,
  None),
 (1,
  1,
  'Andrews. Miss. Kornelia Theodosia',
  'female',
  63.0,
  1,
  0,
  13502,
  77.9583,
  'D7',
  'S',
  10,
  None),
 (1,
  0,
  'Andrews. Mr. Thomas Jr',
  'male',
  39.0,
  0,
  0,
  112050,
  0.0,
  'A36',
  'S',
  None,
  None),
 (1,
  1,
  'Appleton. Mrs. Edward Dale (Charlotte Lamson)',
  'female',
  53.0,
  2,
  0,
  11769,
  51.4792,
  'C101',
  'S',
  'D',
  None),
 (1,
  0,
  'Artagaveytia. Mr. Ramon',
  'male',
  71.0,
  0,
  0,
  'PC 17609',
  49.5042,
  None,
  'C',
  None,
  22.0)]

### Creating Script for non-relational database

In [11]:
text1 = ""

for i in table1.columns:
    text1 += f""""{i}" : row.{i},"""

text1

'"pclass" : row.pclass,"survived" : row.survived,"name" : row.name,"sex" : row.sex,"age" : row.age,"sibsp" : row.sibsp,"parch" : row.parch,"ticket" : row.ticket,"fare" : row.fare,"cabin" : row.cabin,"embarked" : row.embarked,"boat" : row.boat,"body" : row.body,'